{
  "Version": "1.023",
  "ModID": "Community_Patch",
  "IncompatibleIds": null,
  "DeprecateIds": ["Community_Patch_small","Community_Patch_big"],
  "ModDependencies": null,
  "LoadAfterIds": ["*","1_TextBugfixes","CycleShipSkins"],
  "Category": {
    "English": "Fix"
  },
  "ModName": {
    "English": "Community Patch"
  },
  "Description": {
    "English": "Includes many small vanilla Bugfixes and small Quality of Life adjustments. No major game changes. (Unfortunately we can not fix all the bugs still left in the game..)"
  },
  "KnownIssues": [
    {
      "English": null
    }
  ],
  "DLCDependencies": null,
  "CreatorName": "Serp,Taludas,Taubenangriff,Lion053,Kurila,Hier0nimus,Jakob,pnski,Tisogno,Ac3s,Hackner,xn-d,...",
  "CreatorContact": "https://github.com/anno-mods/BugFixes",
  "ModioResourceId": 5121313,
  "changelog": {
    "1.01" : "Add ModioResourceId and changelog to modinfo.json",
    "1.011" : "Release on mod.io",
    "1.012" : "New mod.io ID because of bug (because it was hidden previously)",
    "1.013" : "Update 'Taludas_TransporterRange' to only clamp the transporter range for buildings in StandardStorageList (eg. to exclude Fuel Station)",
    "1.014" : "Update TooltipBugFixes (an incident resolver buff was no longer displayed, fixed)",
    "1.015" : "Update TooltipBugFixes (in rare cases shown percentage for buffs was 0).",
    "1.016" : "Add some translations thx MaxCheng95 and Satanoy Risopatrón Echenique (feel free to contribute your language), add a few more small bugfixes (missing pools and typos) thanks Dark Listener.",
    "1.017" : "Add -infotip-jakob- which adds the current storage amount of goods to the infotip when you hover over product needs in the residence UI.\n And added my mod -MoreInfoTooltips-, which expands the information from tooltips (BUT may be incompatible to tooltip changes from other mods, so report back if tooltips look strange or you have errors/warnings in your logfile):\nShows more complete information in tooltips. Eg. show buildcosts of not yet unlocked ships/buildings or ones you don't have the permit for yet.\n Shows always -available/needed- buildcosts for buildings/ships.\n shows hitpoints of buildings in buildmenu.\n Show more Ship Stats when hovering over them in shiplist/traderoute screen.\n Always show buy/sell price of goods when hovering in Warehouse UI over them.",
    "1.018" : "Adjust 2 german texts.\nImprove the formatting for the current money value in buildcost tooltip, so big amounts are rounded.\nAdd the available amounts also to UpgradeCosts.",
    "1.019" : "Add mod -Hotkey Cycle Ship Skins- from pnski to inlucded mods: Use Shift+Alt+V to cycle through skins of the selected objects.\nUpdated included mod -MoreInfoTooltips-:\n- Add keybind to toggle the infotip when hovering over ship objects in the world off/on (Ctrl+I).\n- Show the Cargo of ships when hovering over them also for allied or spied (sabotage mod) players.\n- Show the buff description from socketed items only for foreign ships (never for own ships) if you spied on them (sabotage mod).\n- Unify the display list of cargo/sockets to always show them below eachother with text, like the vanilla Expedition Tooltip from ships does.\n- If the hovered ship is neither your own, nor from an ally, nor from a spied one, then only display the default stats of this shiptype, not the real ones (so no buffs are considered)",
    "1.020" : "Update included TooltipBugFixes mod: \n- several wrong icon/text bugfixes for newspaper effects and also display positive/negative values\n- add support to display researchpoint generation for all populations in the researchpoints tooltip",
    "1.021" : "Update included MoreInfoTooltips mod: \n- Swap the Text and Name of Ships in the header of the tooltip when hovering over the ships directly.",
    "1.022" : "Add my new mod 'shared_ItemsetTooltip': Hovering over uncompleted ItemSets in your ItemSet-Overview will show you the buffscope (island or session wide) and buff effects (with buff targets) you will reveice when completing the set (in vanilla you dont see the buffs before completing it). ItemSets changed by mods also display the proper tooltip if loaded before 'shared_ItemsetTooltip_Serp'. To make new mod ItemSets also display the buff, see assets.xml of that shared mod for explanation.\nUpdate 'TooltipBugFixes_Serp': Buffs which add more Resolvers for Incidents now only display that once eg. '+1 Doctor', not 2 times anymore.",
    "1.0221" : "Fix syntax error in my code from latest TooltipBugFixes update (did no harm except not fixing a vanilla bug).",
    "1.0222" : "Update included mod 'Repair All Ruins Key (Serp)' to make sure it does not upgrade buildings to next tier.",
    "1.023" : "- Update included MoreInfoTooltips mod: \n- - Add BasePrice of Goods to their tooltip on own island/ships and at traders.\n - Fix Vanilla Quest Bug from Quest 152691 ('Cruise Control' by Gasparov): - - After the second escort the Quest suddenly asks to deliver 0t of undefined, which makes no sense. Fixed."
  }
}